<?php

namespace Database\Seeders;

use App\Models\Story;
use Carbon\Carbon;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class StorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $stories = [
          [
              'user_id' => 4,
              'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
              'published_at' => Carbon::parse(now())->format('Y-m-d'),
          ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
            [
                'user_id' => 4,
                'story' => "تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم تنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقومتنطبق سياسة الخصوصية هذه على كافة البيانات الشخصية، والتي تقوم",
                'published_at' => Carbon::parse(now())->format('Y-m-d'),
            ],
        ];
        foreach ($stories as $story) {
            Story::create($story);
        }
    }
}
